В программировании очень часто возникает необходимость выполнения определенных действий в зависимости от выполнения или невыполнения определенных условий. Для этого в Java, как и в большинстве других языков программирования, используется конструкция `if-else`.
### Базовое использование if
Конструкция `if` позволяет выполнить определенный блок кода, если заданное условие истинно. Условие записывается в круглых скобках, а выполняемый код - в фигурных.

```java
public class Main {
    public static void main(String[] args) {
        int number = 5;
        if (number > 0) {
            System.out.println("Число положительное");
        }
    }
}
```

### Конструкция if-else
Если нужно выполнить другой блок кода в случае, когда условие ложно, используется расширенная конструкция `if-else`.

```java
public class Main {
    public static void main(String[] args) {
        int number = -5;
        if (number > 0) {
            System.out.println("Число положительное");
        } else {
            System.out.println("Число отрицательное или равно нулю");
        }
    }
}
```

### Конструкция if-else-if
Для проверки нескольких условий последовательно можно использовать `else if`. Это позволяет определить дополнительные условия, если предыдущие были ложными.

```java
public class Main {
    public static void main(String[] args) {
        int number = 0;
        if (number > 0) {
            System.out.println("Число положительное");
        } else if (number < 0) {
            System.out.println("Число отрицательное");
        } else {
            System.out.println("Число равно нулю");
        }
    }
}
```

### Вложенные условия
`if-else` конструкции также могут быть вложенными. Это означает, что внутри блока `if` или `else` может находиться другая конструкция `if-else`.

```java
public class Main {
    public static void main(String[] args) {
        int number = 5;
        if (number > 0) {
            if (number % 2 == 0) {
                System.out.println("Число положительное и четное");
            } else {
                System.out.println("Число положительное и нечетное");
            }
        } else {
            System.out.println("Число отрицательное или равно нулю");
        }
    }
}
```

### Тернарный оператор
В Java также существует тернарный оператор, который представляет собой сокращенную форму `if-else`. Он принимает три операнда: условие, значение, если условие истинно, и значение, если условие ложно.

```java
public class Main {
    public static void main(String[] args) {
        int number = 5;
        String result = (number > 0) ? "Число положительное" : "Число отрицательное или равно нулю";
        System.out.println(result);
    }
}
```

Конструкция `if-else` и тернарный оператор дают нам возможность контролировать поток выполнения программы, позволяя выполнять разные действия в зависимости от выполнения различных условий. Это ключевой аспект программирования, который используется в самых разных задачах, от простейших до самых сложных.
# Пример
Давайте рассмотрим простое упражнение, которое включает в себя использование `if-else`.
### Упражнение
**Задача**: Написать программу, которая запрашивает у пользователя ввести три целых числа и выводит на экран самое большое из них.
### Решение
1. **Ввод данных**: Сначала нам нужно запросить у пользователя ввод трех целых чисел. Мы используем класс `Scanner` для этого.
2. **Обработка и сравнение чисел**: Затем мы сравниваем эти числа с помощью конструкции `if-else` для определения самого большого числа.
3. **Вывод результата**: В конце мы выводим самое большое число на экран.
### Код программы
```java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        // Запрос ввода трех чисел
        System.out.print("Введите первое число: ");
        int num1 = scanner.nextInt();
        System.out.print("Введите второе число: ");
        int num2 = scanner.nextInt();
        System.out.print("Введите третье число: ");
        int num3 = scanner.nextInt();

        int largest; // Переменная для хранения наибольшего числа

        // Сравнение чисел
        if (num1 >= num2 && num1 >= num3) {
            largest = num1;
        } else if (num2 >= num1 && num2 >= num3) {
            largest = num2;
        } else {
            largest = num3;
        }

        // Вывод наибольшего числа
        System.out.println("Наибольшее число: " + largest);

        scanner.close();
    }
}
```

### Объяснение работы кода
1. **Создание объекта Scanner**: `Scanner scanner = new Scanner(System.in);` - это строка создает объект `Scanner`, который позволяет читать ввод пользователя из консоли.
2. **Ввод трех чисел**: Мы запрашиваем у пользователя ввести три числа последовательно и сохраняем их в переменных `num1`, `num2`, `num3`.
3. **Определение наибольшего числа**: С помощью конструкции `if-else` мы сравниваем три числа. Мы проверяем, является ли `num1` наибольшим (больше или равно `num2` и `num3`). Если это так, `num1` присваивается переменной `largest`. Аналогичная логика применяется для `num2` и `num3`.
4. **Вывод результата**: После определения наибольшего числа, результат выводится на экран.
5. **Закрытие сканера**: По завершении ввода, сканер закрывается, чтобы освободить ресурсы.

Это упражнение отлично подходит для практики основ программирования на Java, включая ввод-вывод, работу с условиями и выполнение простых арифметических операций.

[[Конструкция Switch-case| Дополнительно - конструкция switch-case]]
[[Циклы, while, for, do-while| Следующая тема]]